Revit 2027 API
TessellatedShapeBuilder.Target Property
 Requests the type of geometry to be built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TessellatedShapeBuilderTarget Target { get; set; }
Public Property Target As TessellatedShapeBuilderTarget
	Get
	Set
public:
property TessellatedShapeBuilderTarget Target {
	TessellatedShapeBuilderTarget get ();
	void set (TessellatedShapeBuilderTarget value);
}
member Target : TessellatedShapeBuilderTarget with get, set
Property Value
TessellatedShapeBuilderTarget
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace